app/controllers/admin_controller.rb

  def users
    @users = User.all(:order=>"created_at DESC")
---
SELECT * FROM `users` ORDER BY created_at DESC

  def sellers
    @sellers = Seller.all(:order=>'created_at desc')
---
SELECT * FROM `sellers` ORDER BY created_at desc

  def feedbacks
    @feedbacks = Feedback.all(:order=>'created_at DESC')
---
SELECT * FROM `feedbacks` ORDER BY created_at DESC