app/controllers/emails_controller.rb

  def index
    @emails = Email.all
---
SELECT * FROM `emails`

  def show
    @email = Email.find(params[:id])
---
SELECT * FROM `emails` WHERE (`emails`.`id` = 1)

  def edit
    @email = Email.find(params[:id])
---
SELECT * FROM `emails` WHERE (`emails`.`id` = 9)

  def create
    @email = Email.new(params[:email])

    respond_to do |format|
      if @email.save
---
INSERT INTO `emails` (`city`, `updated_at`, `mail`, `note`, `is_ok`, `created_at`) VALUES(59, '2010-05-02 07:08:42', '', NULL, NULL, '2010-05-02 07:08:42')