app/controllers/orders_controller.rb

SELECT * FROM `orders`
---
  def index
    @orders = Order.all

SELECT * FROM `orders` WHERE (`orders`.`id` = 1)
---
  def show
    @order = Order.find(params[:id])

SELECT * FROM `orders` WHERE (`orders`.`id` = 1)
---
  def edit
    @order = Order.find(params[:id])

SELECT * FROM `orders` WHERE (`orders`.`id` = 1)
DELETE FROM `orders` WHERE `id` = 1
---
  def destroy
    @order = Order.find(params[:id])
    @order.destroy