app/controllers/products_controller.rb

  def index
    @products = Product.all
---
SELECT * FROM `products`

  def show
    @product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 0)

  def edit
    @product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)
UPDATE `products` SET `started_at` = '2010-05-01 16:38:00', `ended_at` = '2010-05-02 16:38:00', `updated_at` = '2010-05-01 08:20:58' WHERE `id` = 1