app/controllers/users_controller.rb

  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save
---
INSERT INTO `users` (`salt`, `updated_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `activation_code`, `remember_token`, `login`, `email`, `created_at`) VALUES('52ec5d56481afcc43e4f86c75346ac0de9a6d445', '2010-04-25 02:07:00', NULL, '48c51c32a5f40eac6771db26645bef06c4834f67', NULL, 'c302fa74c27559bfbcb4880ecdec0243c52a16bb', NULL, 'kenromae@163.com', 'kenrome@13.com', '2010-04-25 02:07:00')