app/controllers/welcome_controller.rb

  def today
    @product = Product.find(:first,:conditions=>"status=1", :order=>'created_at desc')
---
SELECT * FROM `products` WHERE (status=1) LIMIT 1

  def add_to_cart
    session[:cart] = nil
    if logged_in?
      begin
        product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)

  def add_to_order
    @order = Order.new
    @order.user = current_user
    @order.product = Product.find(params[:product_id])
    @order.order_price = params[:order_price]
    @order.phone = params[:phone]
    if @order.save
---
SELECT * FROM `products` WHERE (`products`.`id` = 49)
SELECT * FROM `users` WHERE (`users`.`id` = 6) LIMIT 1
INSERT INTO `orders` (`discount`, `updated_at`, `order_price`, `product_id`, `quantity`, `pay_type`, `user_id`, `is_pay`, `created_at`) VALUES(NULL, '2010-04-27 01:07:21', 69.0, NULL, NULL, NULL, 6, NULL, '2010-04-27 01:07:21')
UPDATE `products` SET `updated_at` = '2010-05-01 15:26:17', `sold_count` = 31 WHERE `id` = 1